import numpy as np
from keras.datasets import cifar10
from keras.models import Sequential
from keras.layers import Dense, Flatten, GlobalAveragePooling2D
from keras.applications import VGG16, VGG19
from keras.applications import ResNet50, ResNet50V2
from keras.applications import ResNet101, ResNet101V2, ResNet152, ResNet152V2
from keras.applications import DenseNet121, DenseNet169, DenseNet201
from keras.applications import InceptionV3, InceptionResNetV2
from keras.applications import MobileNet, MobileNetV2
# from keras.applications import MobileNetV3Small, MoobileNetV3Large
from keras.applications import NASNetLarge, NASNetMobile
# from keras.applications import EfficientNetB0, EfficientNetB1, EfficientNetB7
from keras.applications import Xception
import tensorflow as tf


#1. 데이터
(x_train, y_train), (x_test, y_test) = cifar10.load_data()

print(x_train.shape, y_train.shape)     # (50000, 32, 32, 3) (50000, 1)
print(x_test.shape, y_test.shape)       # (10000, 32, 32, 3) (10000, 1)


# 2. 모델
models = [VGG16, VGG19, ResNet50, ResNet50V2, ResNet101, ResNet101V2,
          ResNet152, ResNet152V2, DenseNet121, DenseNet169, DenseNet201, 
          InceptionV3, InceptionResNetV2, MobileNet, MobileNetV2,
        #   MobileNetV3Small, MoobileNetV3Large, 
        #   NASNetLarge, NASNetMobile,
        #   EfficientNetB0, EfficientNetB1, EfficientNetB7,
          Xception]

for i in models:
    tfModel = i(weights='imagenet', include_top=False,
                input_shape=(32, 32, 3))

    model = Sequential()
    model.add(tfModel)
    model.add(GlobalAveragePooling2D())
    model.add(Dense(128, activation='relu'))
    model.add(Dense(10, activation='softmax'))
    
    model.trainable = False
    # model.summary()


    print(" ==================================================== ")
    print("모델명 : ", i)
    print("전체 가중치 갯수 : ", len(model.weights))
    print("훈련 가능 가중치 갯수 : ", len(model.trainable_weights))
      

########################### 결과출력 ####################################
# Model: "VGG16"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# vgg16 (Model)                (None, 1, 1, 512)         14714688
# _________________________________________________________________
# global_average_pooling2d_1 ( (None, 512)               0
# _________________________________________________________________
# dense_1 (Dense)              (None, 128)               65664
# _________________________________________________________________
# dense_2 (Dense)              (None, 10)                1290
# =================================================================
# Total params: 14,781,642
# Trainable params: 0
# Non-trainable params: 14,781,642
# _________________________________________________________________
#  ====================================================
# 모델명 :  VGG16
# 전체 가중치 갯수 :  30
# 훈련 가능 가중치 갯수 :  0

# Model: "VGG19"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# vgg19 (Model)                (None, 1, 1, 512)         20024384
# _________________________________________________________________
# global_average_pooling2d_2 ( (None, 512)               0
# _________________________________________________________________
# dense_3 (Dense)              (None, 128)               65664
# _________________________________________________________________
# dense_4 (Dense)              (None, 10)                1290
# =================================================================
# Total params: 20,091,338
# Trainable params: 0
# Non-trainable params: 20,091,338
# _________________________________________________________________
#  ====================================================
# 모델명 :  VGG19
# 전체 가중치 갯수 :  36
# 훈련 가능 가중치 갯수 :  0

# Model: "ResNet50"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# resnet50 (Model)             (None, 1, 1, 2048)        23587712
# _________________________________________________________________
# global_average_pooling2d_3 ( (None, 2048)              0
# _________________________________________________________________
# dense_5 (Dense)              (None, 128)               262272
# _________________________________________________________________
# dense_6 (Dense)              (None, 10)                1290
# =================================================================
# Total params: 23,851,274
# Trainable params: 0
# Non-trainable params: 23,851,274
# _________________________________________________________________
#  ====================================================
# 모델명 :  ResNet50
# 전체 가중치 갯수 :  322
# 훈련 가능 가중치 갯수 :  0

# Model: "ResNet50V2"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# resnet50v2 (Model)           (None, 1, 1, 2048)        23564800
# _________________________________________________________________
# global_average_pooling2d_4 ( (None, 2048)              0
# _________________________________________________________________
# dense_7 (Dense)              (None, 128)               262272
# _________________________________________________________________
# dense_8 (Dense)              (None, 10)                1290
# =================================================================
# Total params: 23,828,362
# Trainable params: 0
# Non-trainable params: 23,828,362
# _________________________________________________________________
#  ====================================================
# 모델명 :  ResNet50V2
# 전체 가중치 갯수 :  274
# 훈련 가능 가중치 갯수 :  0

# Model: "sequential_5"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #   
# =================================================================
# resnet101 (Model)            (None, 1, 1, 2048)        42658176  
# _________________________________________________________________
# global_average_pooling2d_5 ( (None, 2048)              0
# _________________________________________________________________
# dense_9 (Dense)              (None, 128)               262272    
# _________________________________________________________________
# dense_10 (Dense)             (None, 10)                1290      
# =================================================================
# Total params: 42,921,738
# Trainable params: 0
# Non-trainable params: 42,921,738
# _________________________________________________________________
#  ==================================================== 
# 모델명 :  wrapper
# 전체 가중치 갯수 :  628
# 훈련 가능 가중치 갯수 :  0

# Model: "sequential_6"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #   
# =================================================================
# resnet101v2 (Model)          (None, 1, 1, 2048)        42626560  
# _________________________________________________________________
# global_average_pooling2d_6 ( (None, 2048)              0
# _________________________________________________________________
# dense_11 (Dense)             (None, 128)               262272    
# _________________________________________________________________
# dense_12 (Dense)             (None, 10)                1290      
# =================================================================
# Total params: 42,890,122
# Trainable params: 0
# Non-trainable params: 42,890,122
# _________________________________________________________________
#  ==================================================== 
# 모델명 :  wrapper
# 전체 가중치 갯수 :  546
# 훈련 가능 가중치 갯수 :  0

# Model: "sequential_7"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# resnet152 (Model)            (None, 1, 1, 2048)        58370944
# _________________________________________________________________
# global_average_pooling2d_7 ( (None, 2048)              0
# _________________________________________________________________
# dense_13 (Dense)             (None, 128)               262272
# _________________________________________________________________
# dense_14 (Dense)             (None, 10)                1290
# =================================================================
# Total params: 58,634,506
# Trainable params: 0
# Non-trainable params: 58,634,506
# _________________________________________________________________
#  ====================================================
# 모델명 :  wrapper
# 전체 가중치 갯수 :  934
# 훈련 가능 가중치 갯수 :  0

# Model: "sequential_8"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# resnet152v2 (Model)          (None, 1, 1, 2048)        58331648
# _________________________________________________________________
# global_average_pooling2d_8 ( (None, 2048)              0
# _________________________________________________________________
# dense_15 (Dense)             (None, 128)               262272
# _________________________________________________________________
# dense_16 (Dense)             (None, 10)                1290
# =================================================================
# Total params: 58,595,210
# Trainable params: 0
# Non-trainable params: 58,595,210
# _________________________________________________________________
#  ====================================================
# 모델명 :  wrapper
# 전체 가중치 갯수 :  818
# 훈련 가능 가중치 갯수 :  0
# WARNING:tensorflow:From C:\Users\AIA\.conda\envs\tf114\lib\site-packages\keras\backend\tensorflow_backend.py:4074: The name tf.nn.avg_pool is deprecated. 
# Please use tf.nn.avg_pool2d instead.

# Downloading data from https://github.com/keras-team/keras-applications/releases/download/densenet/densenet121_weights_tf_dim_ordering_tf_kernels_notop.h5 
# 29089792/29084464 [==============================] - 8s 0us/step
# Model: "sequential_9"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# densenet121 (Model)          (None, 1, 1, 1024)        7037504
# _________________________________________________________________
# global_average_pooling2d_9 ( (None, 1024)              0
# _________________________________________________________________
# dense_17 (Dense)             (None, 128)               131200
# _________________________________________________________________
# dense_18 (Dense)             (None, 10)                1290
# =================================================================
# Total params: 7,169,994
# Trainable params: 0
# Non-trainable params: 7,169,994
# _________________________________________________________________
#  ====================================================
# 모델명 :  wrapper
# 전체 가중치 갯수 :  608
# 훈련 가능 가중치 갯수 :  0
# Downloading data from https://github.com/keras-team/keras-applications/releases/download/densenet/densenet169_weights_tf_dim_ordering_tf_kernels_notop.h5 
# 51879936/51877672 [==============================] - 5s 0us/step
# Model: "sequential_10"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# densenet169 (Model)          (None, 1, 1, 1664)        12642880
# _________________________________________________________________
# global_average_pooling2d_10  (None, 1664)              0
# _________________________________________________________________
# dense_19 (Dense)             (None, 128)               213120
# _________________________________________________________________
# dense_20 (Dense)             (None, 10)                1290
# =================================================================
# Total params: 12,857,290
# Trainable params: 0
# Non-trainable params: 12,857,290
# _________________________________________________________________
#  ====================================================
# 모델명 :  wrapper
# 전체 가중치 갯수 :  848
# 훈련 가능 가중치 갯수 :  0
# Model: "sequential_11"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# densenet201 (Model)          (None, 1, 1, 1920)        18321984
# _________________________________________________________________
# global_average_pooling2d_11  (None, 1920)              0
# _________________________________________________________________
# dense_21 (Dense)             (None, 128)               245888
# _________________________________________________________________
# dense_22 (Dense)             (None, 10)                1290
# =================================================================
# Total params: 18,569,162
# Trainable params: 0
# Non-trainable params: 18,569,162
# _________________________________________________________________
#  ====================================================
# 모델명 :  wrapper
# 전체 가중치 갯수 :  1008
# 훈련 가능 가중치 갯수 :  0
# ValueError: Input size must be at least 75x75; got `input_shape=(32, 32, 3)`
# ValueError: Input size must be at least 75x75; got `input_shape=(32, 32, 3)`

# Model: "MobileNet"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# mobilenet_1.00_224 (Model)   (None, 1, 1, 1024)        3228864
# _________________________________________________________________
# global_average_pooling2d_1 ( (None, 1024)              0
# _________________________________________________________________
# dense_1 (Dense)              (None, 128)               131200
# _________________________________________________________________
# dense_2 (Dense)              (None, 10)                1290
# =================================================================
# Total params: 3,361,354
# Trainable params: 0
# Non-trainable params: 3,361,354
# _________________________________________________________________
#  ====================================================
# 모델명 : MobileNet
# 전체 가중치 갯수 :  139
# 훈련 가능 가중치 갯수 :  0

# model: "MobileNetV2"
# _________________________________________________________________
# Layer (type)                 Output Shape              Param #
# =================================================================
# mobilenetv2_1.00_224 (Model) (None, 1, 1, 1280)        2257984
# _________________________________________________________________
# global_average_pooling2d_2 ( (None, 1280)              0
# _________________________________________________________________
# dense_3 (Dense)              (None, 128)               163968
# _________________________________________________________________
# dense_4 (Dense)              (None, 10)                1290
# =================================================================
# Total params: 2,423,242
# Trainable params: 0
# Non-trainable params: 2,423,242
# _________________________________________________________________
#  ====================================================
# 모델명 : MobileNetV2
# 전체 가중치 갯수 :  264
# 훈련 가능 가중치 갯수 :  0

# NASNetLarge
# ValueError: When setting `include_top=True` and loading `imagenet` weights, `input_shape` should be (331, 331, 3).